# ---------------------------------------------------------------------------------------------------------------------
#                   Bot by dima203
#               @TestMyNewTelegramBot
# ---------------------------------------------------------------------------------------------------------------------
from handlers import *


# Основной цикл
def main():
    try:
        # Запуск цикла
        BOT.polling()
    except Exception as e:
        # Вызов ошибки при наличии
        raise e
    finally:
        # При завершении сохранить БД
        DATABASE.safe_changes()


if __name__ == '__main__':
    main()
